; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v13 ?v9)
             (pred_11 ?v11 ?v10)
             (pred_10 ?v13 ?v10)
             (pred_12 ?v12 ?v13 )
	     (pred_6 ?v13)
             (pred_3 ?v3)
             (pred_7 ?v11)
             (pred_2 ?v10)
             (pred_5 ?v13)
             (pred_9 ?v11)
             (pred_1 ?v13)
             (pred_8 ))



(:action op_1
:parameters (?v8 ?v2 ?v1 ?v5)
:precondition (and (pred_3 ?v8) (pred_3 ?v2) (pred_7 ?v1) (pred_2 ?v5)
          (pred_4 ?v8 ?v2) (pred_11 ?v1 ?v5)
                   (pred_10 ?v2 ?v5) (pred_6 ?v8) 
                   (pred_5 ?v2) (pred_9 ?v1))
:effect (and  (pred_1 ?v2) (not (pred_5 ?v2))))


(:action op_3
:parameters (?v8 ?v4)
:precondition (and (pred_3 ?v8) (pred_3 ?v4)
               (pred_6 ?v8) (pred_4 ?v8 ?v4) (pred_1 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v8))))

(:action op_5
:parameters (?v8 ?v1)
:precondition (and (pred_3 ?v8) (pred_7 ?v1) 
                  (pred_6 ?v8) (pred_12 ?v1 ?v8) (pred_8 ))
:effect (and (pred_9 ?v1)
   (not (pred_12 ?v1 ?v8)) (not (pred_8 ))))


(:action op_4
:parameters (?v8 ?v6 ?v7)
:precondition (and (pred_3 ?v8) (pred_7 ?v6) (pred_7 ?v7)
                  (pred_6 ?v8) (pred_9 ?v7) (pred_12 ?v6 ?v8))
:effect (and (pred_9 ?v6) (pred_12 ?v7 ?v8)
        (not (pred_9 ?v7)) (not (pred_12 ?v6 ?v8))))

(:action op_2
:parameters (?v8 ?v1)
:precondition (and (pred_3 ?v8) (pred_7 ?v1) 
                  (pred_6 ?v8) (pred_9 ?v1))
:effect (and (pred_8 ) (pred_12 ?v1 ?v8) (not (pred_9 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_20 obj_15 obj_10 obj_17 obj_12 obj_06 obj_01 obj_09 obj_08 obj_05 obj_19 obj_02 obj_18 obj_21 obj_07
    obj_11 obj_03
    obj_13 obj_04 obj_16
    )

    (:init
       (pred_8)

       (pred_3 obj_14)
       (pred_3 obj_20)
       (pred_3 obj_15)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_2 obj_11)
       (pred_2 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_16)

       (pred_4 obj_14 obj_17)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_15 obj_10)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_10 obj_15)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_12)
       (pred_4 obj_17 obj_14)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_17)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_21 obj_07)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_07 obj_19)
       (pred_4 obj_07 obj_21)
       (pred_5 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_15)
       (pred_10  obj_05 obj_11)
       (pred_10  obj_10 obj_03)
       (pred_10  obj_15 obj_11)
       (pred_1 obj_14)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_19)
       (pred_1 obj_02)
       (pred_1 obj_18)
       (pred_1 obj_21)
       (pred_1 obj_07)

       (pred_11  obj_13 obj_11)
       (pred_11  obj_04 obj_03)
       (pred_11  obj_16 obj_03)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_16 obj_12)
       (pred_6 obj_01)
    )

    (:goal (and
       (pred_12 obj_13 obj_17)
    ))
(:constraints
  (always (not (pred_6 obj_06)))
)
)

; plan
1. (op_3 obj_01 obj_19)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_19)
   goals met: 0 of 1
2. (op_3 obj_19 obj_07)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_07)
   goals met: 0 of 1
3. (op_3 obj_07 obj_21)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_21)
   goals met: 0 of 1
4. (op_3 obj_21 obj_18)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_18)
   goals met: 0 of 1
5. (op_3 obj_18 obj_08)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_08)
   goals met: 0 of 1
6. (op_5 obj_08 obj_13)
   deleted: (pred_12 obj_13 obj_08) (pred_8)
   added: (pred_9 obj_13)
   goals met: 0 of 1
7. (op_3 obj_08 obj_12)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_12)
   goals met: 0 of 1
8. (op_3 obj_12 obj_17)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_17)
   goals met: 0 of 1
9. (op_2 obj_17 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_8) (pred_12 obj_13 obj_17)
   goals met: 1 of 1
